<template>
    <div class="ad-block">
        <div class="avatar-block">
            <div class="avatar">
                <div class="img-container"><img src="/img/avatar.png" alt=""></div>
                <div class="name">Anna Shpitz</div>
            </div>
            <div class="rating">
                <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                        <path d="M5.00026 8.1433L2.27519 9.96001C2.10395 10.0742 1.87831 9.93197 1.90742 9.72823L2.36677 6.51275L0.0700009 4.21598C-0.0687343 4.07724 0.0104586 3.83966 0.204688 3.81192L3.40556 3.35465L4.78142 0.144305C4.86388 -0.0481016 5.13665 -0.0481016 5.21911 0.144305L6.59497 3.35465L9.79584 3.81192C9.99007 3.83966 10.0693 4.07724 9.93053 4.21598L7.63376 6.51275L8.09311 9.72823C8.12221 9.93197 7.89658 10.0742 7.72534 9.96001L5.00026 8.1433Z" fill="#F5C61C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="10" height="10" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>
                <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                        <path d="M5.00026 8.1433L2.27519 9.96001C2.10395 10.0742 1.87831 9.93197 1.90742 9.72823L2.36677 6.51275L0.0700009 4.21598C-0.0687343 4.07724 0.0104586 3.83966 0.204688 3.81192L3.40556 3.35465L4.78142 0.144305C4.86388 -0.0481016 5.13665 -0.0481016 5.21911 0.144305L6.59497 3.35465L9.79584 3.81192C9.99007 3.83966 10.0693 4.07724 9.93053 4.21598L7.63376 6.51275L8.09311 9.72823C8.12221 9.93197 7.89658 10.0742 7.72534 9.96001L5.00026 8.1433Z" fill="#F5C61C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="10" height="10" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>
                <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                        <path d="M5.00026 8.1433L2.27519 9.96001C2.10395 10.0742 1.87831 9.93197 1.90742 9.72823L2.36677 6.51275L0.0700009 4.21598C-0.0687343 4.07724 0.0104586 3.83966 0.204688 3.81192L3.40556 3.35465L4.78142 0.144305C4.86388 -0.0481016 5.13665 -0.0481016 5.21911 0.144305L6.59497 3.35465L9.79584 3.81192C9.99007 3.83966 10.0693 4.07724 9.93053 4.21598L7.63376 6.51275L8.09311 9.72823C8.12221 9.93197 7.89658 10.0742 7.72534 9.96001L5.00026 8.1433Z" fill="#F5C61C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="10" height="10" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>
                <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                        <path d="M5.00026 8.1433L2.27519 9.96001C2.10395 10.0742 1.87831 9.93197 1.90742 9.72823L2.36677 6.51275L0.0700009 4.21598C-0.0687343 4.07724 0.0104586 3.83966 0.204688 3.81192L3.40556 3.35465L4.78142 0.144305C4.86388 -0.0481016 5.13665 -0.0481016 5.21911 0.144305L6.59497 3.35465L9.79584 3.81192C9.99007 3.83966 10.0693 4.07724 9.93053 4.21598L7.63376 6.51275L8.09311 9.72823C8.12221 9.93197 7.89658 10.0742 7.72534 9.96001L5.00026 8.1433Z" fill="#F5C61C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="10" height="10" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>
                <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                        <path d="M5.00026 8.1433L2.27519 9.96001C2.10395 10.0742 1.87831 9.93197 1.90742 9.72823L2.36677 6.51275L0.0700009 4.21598C-0.0687343 4.07724 0.0104586 3.83966 0.204688 3.81192L3.40556 3.35465L4.78142 0.144305C4.86388 -0.0481016 5.13665 -0.0481016 5.21911 0.144305L6.59497 3.35465L9.79584 3.81192C9.99007 3.83966 10.0693 4.07724 9.93053 4.21598L7.63376 6.51275L8.09311 9.72823C8.12221 9.93197 7.89658 10.0742 7.72534 9.96001L5.00026 8.1433Z" fill="#F5C61C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="10" height="10" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>
            </div>
        </div>
        <div class="ad-content">
            <div class="ad-text">
                <div class="title">Ничего не нашли? Сложно подобрать проживание?</div>
                <div class="subtitle">Мы подберем для вас проживыание возле вашей стройки)</div>
                <div class="usual-text">Свободное размещение прямо сейчас, мы работаем 24/7</div>
            </div>
            <div class="request">
                <a class="request-item" href="#">Оставте заявку</a>
                <a href="tel:+49 341 1234 2223" class="number-phone">+49 341 1234 2223</a>
                <div class="text">Текст в одну строку</div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
name: "PromoBlock"
}
</script>

<style scoped>

</style>
